import {IconButton, ScrollView, Text, View} from 'native-base';
import React from 'react';
import {Modal} from 'react-native';
import Entypo from 'react-native-vector-icons/Entypo';

export const MatnModal = ({showModal, setShowModal}) => {
  return (
    <Modal
      visible={showModal}
      animationType={'fade'}
      transparent
      onRequestClose={() => {
        setShowModal(false);
      }}>
      <View flex={1} justifyContent={'center'}>
        <View
          alignSelf={'center'}
          style={{
            backgroundColor: 'white',
            borderRadius: 20,
            alignItems: 'center',
            shadowColor: '#000',
            shadowOffset: {
              width: 0,
              height: 2,
            },
            shadowOpacity: 0.25,
            shadowRadius: 4,
            elevation: 5,
          }}
          maxWidth="350"
          h="600">
          <IconButton
            alignSelf={'flex-end'}
            position={'absolute'}
            rounded={2}
            onPress={() => setShowModal(false)}
            icon={<Entypo style={{fontSize: 20, color: 'gray'}} name="cross" />}
          />
          <View
            w={'100%'}
            flexDirection={'row-reverse'}
            borderBottomColor={'gray.400'}
            borderBottomWidth={2}
            flex={0.08}>
            <Text
              alignSelf={'center'}
              fontSize={15}
              fontFamily={'B Yekan'}
              textAlign={'center'}>
              {'سیاست حفظ حریم شخصی تورمیت'}
            </Text>
          </View>

          <View flex={0.92} p={2}>
            <ScrollView>
              <Text fontFamily={'B Yekan'} fontSize={15} textAlign={'right'}>
                تورمیت چگونه از اطلاعات شما حراست می‌کند؟ امروزه با گسترش جریان
                اطلاعات و استفاده روزمره کاربران از اینترنت و وسایل ارتباطی،
                حریم خصوصی کاربران به یکی از جدی‌ترین دغدغه‌ها تبدیل شده‌است.
                نگرانی بسیاری از مشتریان، محفوظ ماندن اطلاعات شخصی همچنین شماره
                موبایل، نام و نام خانوادگی و ایمیل است که برای ثبت نام و لاگین
                شدن به ما می‌سپارند. باید گفت ما نیز اهمیت این موضوع را درک
                می‌کنیم و حریم خصوصی کاربران برای ما اهمیت بسیاری دارد. در ذیل
                سیاست حفظ حریم خصوصی و محرمانگی اطلاعات کاربران را ملاحظه
                خواهیدکرد.{'\n'} {'\n'} چه اطلاعاتی از شما دریافت می‌شود؟ برای
                ثبت نام در اپلیکشین تورمیت لازم است تا اطلاعاتی مانند نام
                کاربری، تلفن همراه و ایمیل خود را در اختیار ما قرار دهید. دریافت
                مشخصات فردی شما نیز صرفاً برای ثبت نام در اپلیکشین هماهنگی‌های
                لازم برای انجام سفارش‌ها، ارسال اعلان‌های مهم و باخبر کردن شما
                از رویدادها و استفاده از خدمات گوناگون تورمیت است.{'\n'} {'\n'}
                چگونه از اطلاعات شما محافظت می‌شود؟ با وجود این‌که امنیت را به
                صورت نسبی تعریف شده است اما در طراحی اپلیکیشن تورمیت سعی شده که
                از بالاترین سطوح امنیتی سخت‌افزاری و نرم‌افزاری در نظر گرفته
                شود. اطلاعات شخصی شما نیز به صورت رمزنگاری‌شده در بستر امن HTTPS
                به وب‌سایت ما منتقل و برای تعاملات بعدی نگهداری خواهند شد.{'\n'}
                {'\n'} چه استفاده‌ای اطلاعات شما خواهد شد؟ چه از نظر قانونی چه
                از نظر اخلاقی ما موظف به صیانت از اطلاعات و پرونده‌های شما
                هستیم. اطلاعات شخصی شما نیز صرفاً جهت تعاملات بعدی به صورت
                کدگذاری‌شده نگهداری می‌شوند تا در سفارش‌ها و درخواست‌های آینده
                بتوانید به راحتی وارد سامانه شوید و سفارش خود را ثبت نمایید. ما
                هم از اسپم متنفریم و ایمیل‌ها و پیام‌های تبلیغاتی را برای
                کاربران‌مان ارسال نخواهیم کرد.
                {'\n'} {'\n'} چه کسانی به اطلاعات شما دسترسی دارند؟ همکاران بخش
                پشتیبانی به برخی از اطلاعات شما دسترسی دارند آن هم برای ارائه
                پشتیبانی بهتر و خدمات با کیفیت‌تر مورد استفاده قرار می‌گیرد.
                تمامی اطلاعات شخصی شما نزد ما محفوظ خواهد ماند و در اختیار افراد
                یا سازمان‌های دیگری قرار نخواهد گرفت. به طور کلی ما موظفیم از
                اطلاعات شما حفاظت و حراست نماییم.
              </Text>
            </ScrollView>
          </View>
        </View>
      </View>
    </Modal>
  );
};
